In [2]:
import pandas as pd
import numpy as np

In [ ]:
p1=pd.Series([100,200,300])                                      #creating a series
p1

0    100
1    200
2    300
dtype: int64

In [ ]:
p2=pd.Series([100,200,300],index=["a","b","c"])               #creating a series with custom index
p2

a    100
b    200
c    300
dtype: int64

In [12]:
p1.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
p1.index=["l","m","n"]                                          #modifying index labels

In [15]:
p1.index

Index(['l', 'm', 'n'], dtype='object')

In [ ]:
p1[0]                                                           #accessing first element using index

C:\Users\PC\AppData\Local\Temp\ipykernel_20116\1178487653.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  p1[0]

np.int64(100)

In [22]:
p1["l"]

np.int64(100)

In [23]:
p1.sum()

np.int64(600)

In [19]:
p1.max()

np.int64(300)

In [20]:
p1.min()

np.int64(100)

In [24]:
type(p1)

pandas.core.series.Series

In [55]:
df1=pd.DataFrame({"Name":["Aaditya","Muskan","Chirag","Rohan"],"Marks":[87,97,91,78],"Age":[20,20,22,21],"Roll No.":[1,2,3,4]})    #creating a dataframe

In [56]:
df1

      Name  Marks  Age  Roll No.
0  Aaditya     87   20         1
1   Muskan     97   20         2
2   Chirag     91   22         3
3    Rohan     78   21         4

In [57]:
type(df1)

pandas.core.frame.DataFrame

In [58]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [59]:
df1.columns                                                       #accessing column labels

Index(['Name', 'Marks', 'Age', 'Roll No.'], dtype='object')

In [60]:
df1['Marks']                                                     #accessing a column

0    87
1    97
2    91
3    78
Name: Marks, dtype: int64

In [61]:
df1['Marks']=[90,100,95,85]

In [62]:
df1

      Name  Marks  Age  Roll No.
0  Aaditya     90   20         1
1   Muskan    100   20         2
2   Chirag     95   22         3
3    Rohan     85   21         4

In [64]:
df1.iloc[0:3,0:4]

      Name  Marks  Age  Roll No.
0  Aaditya     90   20         1
1   Muskan    100   20         2
2   Chirag     95   22         3